---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.SymbolGeometryId
source: html/b1c6ff85-e1a7-923a-d566-eea2b8833bfb.htm
---
# SymbolGeometryId Members

Returns a string suitable to determine if two instances point to the same piece of geometry managed by the same symbol element.